let normalKVOperations = AzureActivity
| where TimeGenerated > ago(30d)
| where ResourceProviderValue == "MICROSOFT.KEYVAULT"
| distinct CallerIpAddress, Caller;
AzureActivity
| distinct CallerIpAddress, Caller
| join kind=rightanti (normalKVOperations) on CallerIpAddress, Caller
